Revit 2026 API

# FabricationHostedInfo Properties

---

The FabricationHostedInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HostId | Returns the identifier of the host. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FabricationHostedInfo Class

Autodesk.Revit.DB Namespace